{"version":"1","records":[{"hierarchy":{"lvl1":"Advanced usage"},"type":"lvl1","url":"/advanced-usage","position":0},{"hierarchy":{"lvl1":"Advanced usage"},"content":"uv is a tool for creating virtual environments (along with many other features !) that can be useful for working on Alliance Canada resources.\nFor example, to download uv and \n\ncreate a Python environment with \n\ndatalad installed:# download uv\ncurl -LsSf https://astral.sh/uv/install.sh | sh\n\n# verify uv installation\nuv -h\n\n# create datalad venv\nuv venv datalad --python=3.12\n\n# activate datalad venv\nsource datalad/bin/activate\n\n# install git-annex and datalad\nuv pip install git-annex datalad\n\n# verify datalad installation\ndatalad --help\n\n# deactivate datalad venv\ndeactivate\n\nWe can then use this datalad environment to \n\naccess existing datasets on the local RIA store.\nWe will \n\nuse a reckless --ephemeral installation of the dataset such that we do not consume additional inodes, and our changes do not modify the original dataset.\nAs an example, to access the cneuromod.things.fmriprep dataset:source datalad/bin/activate\n\n# to install the cneuromod.things.fmriprep dataset from the Rorqual RIA store\ndatalad install --reckless 'ephemeral' ria+file://$HOME/links/projects/rrg-pbellec/ria-rorqual#~cneuromod.things.fmriprep","type":"content","url":"/advanced-usage","position":1},{"hierarchy":{"lvl1":"Let’s get started"},"type":"lvl1","url":"/quick-start","position":0},{"hierarchy":{"lvl1":"Let’s get started"},"content":"The lab applies for storage space and compute time on Alliance Canada every year.\nThese resources are limited and have to be shared fairly across members of the lab.\nGiven that no member of the lab has privileged admin rights, this fairness relies on everyone adopting a clear code of conduct, and shared organization.","type":"content","url":"/quick-start","position":1},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Get access"},"type":"lvl2","url":"/quick-start#get-access","position":2},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Get access"},"content":"To get access to simexp resources in Alliance Canada, create an account on \n\nCCDB and then apply for resources under tab “My Account”,  select “Apply for a new role”, then apply the appropriate role with CCRI gsf-624-02. Note that the main allocation of the lab is currently hosted on \n\nrorqual.","type":"content","url":"/quick-start#get-access","position":3},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Submitting jobs"},"type":"lvl2","url":"/quick-start#submitting-jobs","position":4},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Submitting jobs"},"content":"You can learn more on high-performance computing (HPC) and the Digital Alliance using their \n\ndocs. The compute allocation of the lab (only available on rorqual) can be accessed using the code gsf-624-ab. You can log on any HPC of the Alliance, but you will only have access to the default compute allocation there (gsf-624-aa). Note that each HPC is managed independently, so compute launched on, say, beluga does not affect our rorqual allocation.","type":"content","url":"/quick-start#submitting-jobs","position":5},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Setup your environment"},"type":"lvl2","url":"/quick-start#setup-your-environment","position":6},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Setup your environment"},"content":"When you are new to Alliance Canada, we will ask you to run a setup script that will set data management access and give you access to utils for project management, including:\n\nsetup ACLs for the data admin to the project and nearline folders\n\nadd project management commands to your bash environment\n\ngenerate SSH keys if not already created, and help you set them up on Github for easier access\n\nconfigure the ssh agent and keychain to avoid typing your ssh key password each time you push to github or ssh to another server.\n\nconfigure git global variables\n\nYou can do it just once on each cluster:/project/def-pbellec/share/data_admin/utils/setup_user_account.sh","type":"content","url":"/quick-start#setup-your-environment","position":7},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Add a new dataset"},"type":"lvl2","url":"/quick-start#add-a-new-dataset","position":8},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Add a new dataset"},"content":"Datasets are stored in ~/project/(rrg|def)-pbellec/datasets\n\nImportant\n\n When applying to gain access to a dataset, it is important that you involve the lab’s management so they can sign data sharing agreement, make sure the use of data is covered by an ethics agreement or other necessary steps. If you want to add a new dataset please contact the lab’s data admin (Basile).","type":"content","url":"/quick-start#add-a-new-dataset","position":9},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Renewing or terminating your role"},"type":"lvl2","url":"/quick-start#renewing-or-terminating-your-role","position":10},{"hierarchy":{"lvl1":"Let’s get started","lvl2":"Renewing or terminating your role"},"content":"Every year Digital alliance requires you to renew your account. It is important to do so on a timely fashion in order to prevent interruption in access. If you change position within the lab, your current role will be terminated and you will be required to re-apply under a new role.","type":"content","url":"/quick-start#renewing-or-terminating-your-role","position":11},{"hierarchy":{"lvl1":"Resource tracking"},"type":"lvl1","url":"/resource-tracking","position":0},{"hierarchy":{"lvl1":"Resource tracking"},"content":"Tracking resource usage is helpful to understand how your jobs are currently consuming cluster resources and to monitor for any unexpected changes (e.g., large, unexpected changes in priority can reveal when jobs may be less efficient than expected).\nIn this section, we provide general guidelines for checking your account’s (and its associated allocation’s) resource usage using both a \n\nGUI-based dashboard as well as via directly \n\nat the command line.\nWe also overview how to \n\ncheck current usage patterns on a given cluster, such that you can make an informed choice about which resources to request.","type":"content","url":"/resource-tracking","position":1},{"hierarchy":{"lvl1":"Resource tracking","lvl2":"Using the Metrix portal"},"type":"lvl2","url":"/resource-tracking#using-the-metrix-portal","position":2},{"hierarchy":{"lvl1":"Resource tracking","lvl2":"Using the Metrix portal"},"content":"Alliance Canada maintains a \n\nmetrix portal for each of its clusters.\nPlease refer to the the Alliance Canada documentation for each cluster (e.g., \n\nRorqual) for the most up-to-date link for the portal.\n\nThis is the most user-friendly way to access all of the information we discuss below.\nHowever, it is still a good idea to understand how to access this information outside of the metrix portal; as this data is pulled in real time, it may fail to populate if the system is over-subscribed !\nIf there is a known problem with the Metrix portal, this should be documentated on \n\nhttps://​status​.alliancecan​.ca.","type":"content","url":"/resource-tracking#using-the-metrix-portal","position":3},{"hierarchy":{"lvl1":"Resource tracking","lvl2":"Tracking resource usage at an account level"},"type":"lvl2","url":"/resource-tracking#tracking-resource-usage-at-an-account-level","position":4},{"hierarchy":{"lvl1":"Resource tracking","lvl2":"Tracking resource usage at an account level"},"content":"To view all users in a given allocation (e.g., rrg-pbellec_gpu) or in multiple allocations, we can run:sshare -l --accounts=rrg-pbellec_gpu -a\n\nWe can also pass multiple allocations in a comma-separated list.\nTo view only a subset of users within allocations, simply pass the -u flag with the relevant user name(s):sshare -l --accounts=rrg-pbellec_cpu,def-pbellec_cpu -u emdupre\n\nWe can interpret each of the returned fields following \n\nAlliance Canada’s documentation:\n\nRawShares is proportional to the number of CPU-years that was granted to the project for use on this cluster in the Resource Allocation Competition.\n\nNormShares is the number of shares assigned to the user (or account) divided by the total number of assigned shares within the level.\n\nRawUsage is calculated from the total number of resource-seconds (that is, CPU time, GPU time, and memory) that have been charged to this account. Past usage is discounted with a half-life of one week, so usage more than a few weeks in the past will have only a small effect on priority.\n\nEffectvUsage is the account’s usage normalized with its parent; that is, the project’s usage relative to other projects, the user’s relative to other users in that project.\n\nLevelFS is the account’s fairshare value compared to its siblings, calculated as NormShares / EffectvUsage.\n\nIf an account is over-served, the value is between 0 and 1.\n\nIf an account is under-served, the value is greater than 1.\n\nAccounts with no usage receive the highest possible value, inf or “infinity”.","type":"content","url":"/resource-tracking#tracking-resource-usage-at-an-account-level","position":5},{"hierarchy":{"lvl1":"Resource tracking","lvl3":"Tracking resource usage at a job level","lvl2":"Tracking resource usage at an account level"},"type":"lvl3","url":"/resource-tracking#tracking-resource-usage-at-a-job-level","position":6},{"hierarchy":{"lvl1":"Resource tracking","lvl3":"Tracking resource usage at a job level","lvl2":"Tracking resource usage at an account level"},"content":"The Alliance Canada documentation has lots of resources for \n\nmonitoring jobs, including tracking their resource usage.\n\nOne useful command to get a full accounting of a completed job is with scontrol:scontrol show job -dd <JOBID>","type":"content","url":"/resource-tracking#tracking-resource-usage-at-a-job-level","position":7},{"hierarchy":{"lvl1":"Resource tracking","lvl2":"Requesting resources"},"type":"lvl2","url":"/resource-tracking#requesting-resources","position":8},{"hierarchy":{"lvl1":"Resource tracking","lvl2":"Requesting resources"},"content":"In order to more efficiently request resources, we can use the partition-stats command, called simply using:partition-stats\n\nWe can interpret its output again following the \n\nAlliance Canada documentation.\nSpecifically, the command will return:\n\nhow many jobs are waiting to run (“queued”) in each partition,\n\nhow many jobs are currently running,\n\nhow many nodes are currently idle, and\n\nhow many nodes are assigned to each partition.","type":"content","url":"/resource-tracking#requesting-resources","position":9},{"hierarchy":{"lvl1":"Resource tracking","lvl3":"Estimating start time for a given job","lvl2":"Requesting resources"},"type":"lvl3","url":"/resource-tracking#estimating-start-time-for-a-given-job","position":10},{"hierarchy":{"lvl1":"Resource tracking","lvl3":"Estimating start time for a given job","lvl2":"Requesting resources"},"content":"As Alliance Resources \n\nimplement backfilling, jobs are not strictly started in terms of priority order, but also in terms of what resources are available.\nThe start time for a given job can therefore be estimated using:squeue --start -j <JOBID>\n\nNote, though, that this is not a strictly accurate estimate, as it depends on multiple factors including that other, currently running jobs have requested accurate time limits.","type":"content","url":"/resource-tracking#estimating-start-time-for-a-given-job","position":11},{"hierarchy":{"lvl1":"Code of conduct"},"type":"lvl1","url":"/coc","position":0},{"hierarchy":{"lvl1":"Code of conduct"},"content":"The laboratory for brain simulation and exploration (SIMEXP) is dedicated to providing an environment where people are kind and respectful to each other. This could really be the end of that code of conduct, but some forms of harassment and negative behavior are fairly hard to identify at first. Please read carefully through the rest of the document to make sure you avoid them. There is also a section to know what to do and expect if you experience behavior that deviates from this code of conduct.","type":"content","url":"/coc","position":1},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Respecting differences"},"type":"lvl2","url":"/coc#respecting-differences","position":2},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Respecting differences"},"content":"SIMEXP members come from many cultures and backgrounds. We therefore expect lab members to be very respectful of different cultural practices, attitudes, and beliefs. This includes being aware of preferred titles and pronouns, as well as using a respectful tone of voice.\n\nWhile we do not assume SIMEXP members know the cultural practices of every ethnic and cultural group, we expect members to recognize and respect differences within our community. This means being open to learning from and educating others, as well as educating yourself.","type":"content","url":"/coc#respecting-differences","position":3},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Harassment"},"type":"lvl2","url":"/coc#harassment","position":4},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Harassment"},"content":"No form of harassment will be tolerated. Harassment includes, but is not limited to:\n\nVerbal comments that reinforce social structures of domination related to gender, gender identity and expression, sexual orientation, diet (vegetarian, lactose-free, vegan, etc), disability, marital or family status, pregnancy, pregnancy-related conditions, physical appearance, body size, race, age or religion.\n\nSexual images in public spaces\n\nDeliberate intimidation, stalking, or following\n\nHarassing photography or recording\n\nSustained disruption of work\n\nInappropriate physical contact\n\nUnwelcome sexual attention\n\nAdvocating for, or encouraging, any of the above behaviour","type":"content","url":"/coc#harassment","position":5},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Microaggressions"},"type":"lvl2","url":"/coc#microaggressions","position":6},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Microaggressions"},"content":"Incidents can take the form of “microaggressions,” which is a damaging form of harassment. Microaggressions are the everyday slights or insults which communicate negative messages to target individuals, often based upon their marginalized group membership. The \n\nmicropedia of microaggression is an excellent resource to learn more on the may forms microaggression can take (see some examples in the note below). Over time, microagressions can take a great toll on mental and emotional health, and the target’s feeling of belonging in science and academia.\n\nNote\n\nThe following examples can all be labelled micro-aggressions:\n\ncommenting on a woman’s appearance rather than her work;\n\nonly directing questions at male colleagues when there are female experts in the room;\n\ntelling someone of colour that they “speak such good English”;\n\nforcefully praising meat to an individual with a vegetarian diet;\n\npraising alcoholic drinks to an individual who do not consume them.\n\nExclusion from a group can be a common nonverbal form of microaggression.\n\nMicroaggressions can be couched in the form of a “compliment,” (e.g. “you’re too attractive to be a scientist”).","type":"content","url":"/coc#microaggressions","position":7},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Enforcement"},"type":"lvl2","url":"/coc#enforcement","position":8},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Enforcement"},"content":"Members should seek to pro-actively eliminate behaviors that deviate from our code of conduct. If a member engages in harassing behaviour, the direction of the laboratory and the research center will take any actions necessary to keep the SIMEXP lab a welcoming environment for all. This includes warning the offender, and potentially expulsion from the laboratory. We expect laboratory members to follow these rules at the office and work-related social activities. Members asked to stop any harassing behavior are expected to comply immediately. We think people should follow these rules outside of work too!","type":"content","url":"/coc#enforcement","position":9},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Reporting"},"type":"lvl2","url":"/coc#reporting","position":10},{"hierarchy":{"lvl1":"Code of conduct","lvl2":"Reporting"},"content":"If someone makes you or anyone else feel unsafe or unwelcome, please report it as soon as possible in person, or in writing to \n\nPierre Bellec or \n\nJulie Boyle. It is also possible to make a report with the \n\ndirection of CRIUGM. The direction will follow up with you to understand the problem, and take the necessary actions to resolve it without your direct involvement. Harassment and other code of conduct violations considerably reduce the value of the research environment for everyone, and are taken very seriously. We strive to make the SIMEXP environment rich and joyful for everyone, at all time.","type":"content","url":"/coc#reporting","position":11},{"hierarchy":{"lvl1":"Contributing"},"type":"lvl1","url":"/contributing","position":0},{"hierarchy":{"lvl1":"Contributing"},"content":"This is a laboratory website maintained by the SIMEXP team. Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given. You can contribute in the ways listed below.","type":"content","url":"/contributing","position":1},{"hierarchy":{"lvl1":"Contributing","lvl2":"Improve the content"},"type":"lvl2","url":"/contributing#improve-the-content","position":2},{"hierarchy":{"lvl1":"Contributing","lvl2":"Improve the content"},"content":"Fixing typos or suggestion changes to the text is very much appreciated. The layout can always be improved too! Whether you directly implement the changes or just make a general suggestion, do not hesitate to raise an issue.","type":"content","url":"/contributing#improve-the-content","position":3},{"hierarchy":{"lvl1":"Contributing","lvl2":"Add content"},"type":"lvl2","url":"/contributing#add-content","position":4},{"hierarchy":{"lvl1":"Contributing","lvl2":"Add content"},"content":"The SIMEXP website can always use more documentation on the laboratory operations. Any other idea is also welcome.","type":"content","url":"/contributing#add-content","position":5},{"hierarchy":{"lvl1":"Contributing","lvl2":"Get Started"},"type":"lvl2","url":"/contributing#get-started","position":6},{"hierarchy":{"lvl1":"Contributing","lvl2":"Get Started"},"content":"Ready to contribute? Here’s how to set up SIMEXP website for local development.\n\nFork the repo on GitHub.\n\nClone your fork locally.\n\nInstall your local copy into a virtualenv, e.g., using virtualenvwrapper or conda.\n\nCreate a branch for local development and make changes locally.\n\nCommit your changes and push your branch to GitHub.\n\nSubmit a pull request through the GitHub website.","type":"content","url":"/contributing#get-started","position":7},{"hierarchy":{"lvl1":"Contributing","lvl2":"Code of Conduct"},"type":"lvl2","url":"/contributing#code-of-conduct","position":8},{"hierarchy":{"lvl1":"Contributing","lvl2":"Code of Conduct"},"content":"Please note that the SIMEXP website project is released with a \n\nCode of Conduct. By contributing to this project you agree to abide by its terms.","type":"content","url":"/contributing#code-of-conduct","position":9},{"hierarchy":{"lvl1":"SIMEXP"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"SIMEXP"},"content":"\n\nThe laboratory for brain simulation and exploration (SIMEXP) is located in Montreal and affiliated with the \n\nCRIUGM, \n\nCSS-MTL and \n\nUniversité de Montréal. The main objective of the lab is to train artificial neural networks in order to jointly mimic individual human brain activity and behaviour, notably leading the Courtois project on neuronal modelling (\n\nCNeuroMod). The SIMEXP lab also translates these models to identify markers of brain disorders using neuroimaging data.\n\n\n\nCRIUGM\n\nResearch centre of the Montreal Geriatrics Institute\n\n\n\nUdeM\n\nPsychology department, University of Montreal\n\n\n\nCNeuroMod\n\nThe Courtois project on neuronal modelling","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Manifesto"},"type":"lvl1","url":"/manifesto","position":0},{"hierarchy":{"lvl1":"Manifesto"},"content":"Academia means different things to different people. The laboratory for brain simulation and exploration (SIMEXP) is founded on a fairly opinionated, and possibly unusual view of what academia is. This document tries to make the SIMEXP academic values explicit. It does not mean that everybody at SIMEXP shares all of these values, or operates under a particular value at all times. These values are rather guiding principles for many key aspects of the operations of the lab, and form a baseline for expectations.","type":"content","url":"/manifesto","position":1},{"hierarchy":{"lvl1":"Manifesto","lvl2":"The hacker way"},"type":"lvl2","url":"/manifesto#the-hacker-way","position":2},{"hierarchy":{"lvl1":"Manifesto","lvl2":"The hacker way"},"content":"Sharing is a key aspect of all academic communities, but how that sharing works varies widely. Lots of academic collaborations are transactional in nature, with people exchanging one contribution for another. Original founders of free software and the hacker movement operate under very different, simple rules. If you want to learn about something, just ask and you can expect an answer. The day somebody wants to learn something from you, you are expected to help that person. Don’t try to balance out what you get and give to a particular person. By helping others, you’re just building up karma, doing good to your community and the world. A corollary of that collaborative ethos is to strive to openly share as much research material as possible, data, code and ideas. The sharing process is greatly facilitated by adopting tools designed for sharing in your daily research activities (“open by design”).","type":"content","url":"/manifesto#the-hacker-way","position":3},{"hierarchy":{"lvl1":"Manifesto","lvl2":"The brainhack way"},"type":"lvl2","url":"/manifesto#the-brainhack-way","position":4},{"hierarchy":{"lvl1":"Manifesto","lvl2":"The brainhack way"},"content":"Some laboratories operate under pretty strict labor division, with technical assistants helping researchers implement specific methods. SIMEXP works in data science, and our methods are computational. On one hand, relying on other people to implement computations dramatically limits both your ability to iterate quickly, and your understanding of the methods. On another hand, blind applications of algorithms to neural data without deep understanding of the neuroscience questions is not productive and is, in our typical use cases, a complete waste of time. A core SIMEXP belief is that lab members need to develop both strong computational and neuroscience skills, on top of their own area of expertise. This can be arduous at times, but is key for the type of research we do. It is also a huge asset for employability both inside and outside of academia.","type":"content","url":"/manifesto#the-brainhack-way","position":5},{"hierarchy":{"lvl1":"Manifesto","lvl2":"Automate all the things"},"type":"lvl2","url":"/manifesto#automate-all-the-things","position":6},{"hierarchy":{"lvl1":"Manifesto","lvl2":"Automate all the things"},"content":"Neural data science requires us to iterate analyses a lot, to explore new ideas, replicate analyses on new datasets, and test the impact of various hyper-parameters. This means that data analysis operations should be automated to the greatest extent possible.","type":"content","url":"/manifesto#automate-all-the-things","position":7},{"hierarchy":{"lvl1":"Manifesto","lvl2":"The academic game is not the endgame"},"type":"lvl2","url":"/manifesto#the-academic-game-is-not-the-endgame","position":8},{"hierarchy":{"lvl1":"Manifesto","lvl2":"The academic game is not the endgame"},"content":"Academia is a highly competitive environment. Some individuals end up focussing their work based on the metrics used to assess them, out of fear of not surviving the game, or simply thinking that it is what the academic community expects them to do. This means that many labs expend considerable energy towards publishing in high impact-factor journals, apply to awards, attend as many conferences as possible, get invited presentations, and sit on many committees, amongst others. The SIMEXP lab does of course support the careers of lab members, whether academic or not, and makes strategic investment of resources towards these metrics. But it is critical to not lose sight that pretty much none of us went into academia to work towards these metrics. The endgame of SIMEXP is to solve problems, namely prognosis of Alzheimer’s disease, and building human-like artificial neural networks. The academic game is a means to these ends. Nothing more. We aim to keep our collective and individual academic boats afloat with bare minimum required efforts, and are committed to not let the academic game ruin the fun and joy we have doing research. We rightfully trust that doing elite research, prioritizing quality over quantity, is all it really takes to strive inside and outside of academia anyway.","type":"content","url":"/manifesto#the-academic-game-is-not-the-endgame","position":9},{"hierarchy":{"lvl1":"Manifesto","lvl2":"Well-being"},"type":"lvl2","url":"/manifesto#well-being","position":10},{"hierarchy":{"lvl1":"Manifesto","lvl2":"Well-being"},"content":"Finally, there are workplaces that encourage, or even push people to work themselves into the ground. It will happen from time to time to work hard, for a deadline or for the flow. But nothing great happens with chronically overworked people, especially in a creative business. Make sure you take care of yourself. If you feel down or tired, please take as many days off as necessary. Take holidays, it’s great. It is OK to focus on your personal life at times. It is also OK to pass on opportunities, you can’t do it all. Others will come. If you feel overwhelmed, find support. If you see someone being overwhelmed, be patient and supportive. Friends, peers or professionals, there are many ways to find balance. Try to find the mix that works for you, and be proactive at building this support network. You can also join us for Yoga!","type":"content","url":"/manifesto#well-being","position":11},{"hierarchy":{"lvl1":"Members"},"type":"lvl1","url":"/members","position":0},{"hierarchy":{"lvl1":"Members"},"content":"","type":"content","url":"/members","position":1},{"hierarchy":{"lvl1":"Members","lvl2":"Staff"},"type":"lvl2","url":"/members#staff","position":2},{"hierarchy":{"lvl1":"Members","lvl2":"Staff"},"content":"\n\nLune Bellec\n\nProfessor and laboratory director\n\n\n\nJulie Boyle\n\nProject manager\n\n\n\nBasile Pinsard\n\nData engineer\n\n\n\nMarie St-Laurent\n\nData scientist - digital brain phantom trainer","type":"content","url":"/members#staff","position":3},{"hierarchy":{"lvl1":"Members","lvl2":"Post-doctoral fellows"},"type":"lvl2","url":"/members#post-doctoral-fellows","position":4},{"hierarchy":{"lvl1":"Members","lvl2":"Post-doctoral fellows"},"content":"\n\nHao-Ting Wang\n\nPost-doctoral fellow - foundation models for fMRI\n\n\n\nIsil Bilgin\n\nPost-doctoral fellow - brain-aligned large language models - co-supervision with Dr Leila Wehbe\n\n\n\nYann Harel\n\nPost-doctoral fellow - brain/behaviour correlates of flow in videogames - co-supervision with Dr Karim Jerbi\n\n\n\nElizabeth DuPre\n\nPost-doctoral fellow - finding shared functional patterns via alignment techniques","type":"content","url":"/members#post-doctoral-fellows","position":5},{"hierarchy":{"lvl1":"Members","lvl2":"PhD students"},"type":"lvl2","url":"/members#phd-students","position":6},{"hierarchy":{"lvl1":"Members","lvl2":"PhD students"},"content":"\n\nMaëlle Freteault\n\nPhd student - personalized auditory brain encoding models - co-supervision with Dr Nicolas Farrugia\n\n\n\nMaximilien LeClei\n\nPhD student - neuroevolution for human alignment in videogames\n\n\n\nMarie-Ève Picard\n\nPhD student - physiological correlates of brain/behaviour in videogames - co-supervision with Dr Pierre Rainville\n\n\n\nPravish Sainath\n\nPhd student - brain alignment in memory models - co-supervision with Dr Guillaume Lajoie","type":"content","url":"/members#phd-students","position":7},{"hierarchy":{"lvl1":"Members","lvl2":"Master’s students"},"type":"lvl2","url":"/members#masters-students","position":8},{"hierarchy":{"lvl1":"Members","lvl2":"Master’s students"},"content":"\n\nHugo Delhaye\n\nMaster’s student in psychology - measuring curiosity in videogames - co-supervision with Dr Audrey Durand\n\n\n\nSara Barbu\n\nVolunteer intern (also Master’s student in psychology) - The Image10k dataset of natural images - co-supervision with Dr Valentina Borghesani","type":"content","url":"/members#masters-students","position":9},{"hierarchy":{"lvl1":"Members","lvl2":"Bachelor students"},"type":"lvl2","url":"/members#bachelor-students","position":10},{"hierarchy":{"lvl1":"Members","lvl2":"Bachelor students"},"content":"\n\nRaphaëlle Jourde\n\nVolunteer intern (also Bachelor student in criminology) - The Cozmo mask fMRI pilot task - co-supervision with Dr Yann Harel\n\n\n\nCléo Lam\n\nVolunteer intern (also Bachelor student in computer science) - The Cozmo mask fMRI pilot task - co-supervision with Dr Yann Harel","type":"content","url":"/members#bachelor-students","position":11},{"hierarchy":{"lvl1":"Members","lvl2":"Alumni"},"type":"lvl2","url":"/members#alumni","position":12},{"hierarchy":{"lvl1":"Members","lvl2":"Alumni"},"content":"François Paugam, PhD student (2025) - brain/behaviour imitation in videogames - co-supervision with Dr Guillaume Lajoie\n\nSana Ahmhadi, PhD student (2024) - scaling up brain encoding models with high-performance computing - co-supervision with Dr Tristan Glatarad\n\nMikkel Schöttner, PhD student visitor Mitacs internship (2024) - graph neural network for brain/phenotype association in HCP.","type":"content","url":"/members#alumni","position":13}]}